{
  "basics": {
    "name": "Sergio Machaca",
    "image": "",
    "email": "smachac2 at jh dot edu",
    "summary": "Graduate Research Assistant at HAMR Lab and PhD Candidate in Mechanical Engineering, Johns Hopkins University.",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "sergiomachaca",
        "url": "https://www.linkedin.com/in/sergiomachaca/"
      }
    ]
  },
  "work": [
    {
      "name": "Haptics and Medical Robotics Laboratory, Johns Hopkins University",
      "position": "Graduate Research Assistant",
      "url": "https://hamr.lcsr.jhu.edu",
      "startDate": "2018-08-01",
      "endDate": "2024-12-31",
      "summary": "Developing objective skill assessment and haptic feedback framework for robotic minimally invasive surgery training.",
      "highlights": ["Skill Assessment, Haptics, Medical Robotics"]
    }
  ],
  "education": [
    {
      "institution": "Johns Hopkins University",
      "location": "Baltimore, MD, USA",
      "url": "https://www.jhu.edu/",
      "area": "Mechanical Engineering",
      "studyType": "PhD",
      "startDate": "August 2018",
      "endDate": "December 2024"
    }
  ],
  "awards": [
    {
      "title": "Modeling, Simulation, and Training (MS&T) Fellowship",
      "date": "2022-2024",
      "awarder": "Link Foundation",
      "url": "https://linksim.org",
      "summary": "The Link Foundation supports programs to foster the theoretical basis, practical knowledge, and application of energy, simulation, and ocean engineering and instrumentation research, and to disseminate the results of that research through lectures, seminars and publications."
    },
    {
      "title": "Graduate Research Fellowships Program (GRFP)",
      "date": "2019-2021",
      "awarder": "National Science Foundation",
      "url": "https://www.nsfgrfp.org",
      "summary": "The purpose of the NSF Graduate Research Fellowship Program (GRFP) is to help ensure the quality, vitality, and diversity of the scientific and engineering workforce of the United States. A goal of the program is to broaden participation of the full spectrum of diverse talents in STEM.. The program recognizes and supports outstanding graduate students in NSF-supported science, technology, engineering, and mathematics disciplines who are pursuing research-based master’s and doctoral degrees at accredited United States institutions."
    }
  ],
  "publications": [
    {
      "name": "Towards an Understanding of the Utility of Dual-Modality Haptic Feedback in Teleoperated Medical Devices",
      "publisher": "IEEE Transactions on Medical Robotics and Bionics",
      "releaseDate": "2020-10-27",
      "doi": "10.1109/TMRB.2020.3034254",
      "summary": "Humans normally integrate multiple haptic signals during dexterous manipulation with the natural limb. Operating telerobots such as surgical robots and upper-limb prostheses removes this multimodality feedback. While considerable research has focused on single-modality haptic feedback and discrete multimodality haptic feedback, little is known regarding the utility of continuous multimodality feedback. Here, we present an experimental framework designed to explore continuous multimodality haptic feedback for dexterous manipulation. Participants performed a grasp-and-hold task in a virtual environment with either direct or myoelectric control under different haptic feedback conditions: no feedback, vibrotactile feedback of object slip, squeeze feedback of grip force, and combined vibrotactile and squeeze feedback. Results from preliminary pilot studies highlight the gap in knowledge surrounding the potential utility of continuous multimodality feedback in differing telerobot control scenarios."
    },
    {
      "name": "Dynamics and Thermodynamics of Air-Driven Active Spinners",
      "publisher": "Soft Matter",
      "releaseDate": "2018-05-24",
      "doi": "10.1039/C8SM00403J",
      "summary": "We report on the collective behavior of active particles in which energy is continuously supplied to rotational degrees of freedom. The active spinners are 3D-printed disks, 1 cm in diameter, that have an embedded fan-like structure, such that a sub-levitating up-flow of air forces them to spin. Single spinners exhibit Brownian motion with a narrow Gaussian velocity distribution function, P(v), for translational motion. We study the evolution of P(v) as the packing fraction and the average single particle spin speeds are varied. The interparticle hydrodynamic interaction is negligible, and the dynamics is dominated by hyperelastic collisions and dissipative forces. As expected for nonequilibrium systems, P(v) for a collection of many spinners deviates from Gaussian behavior. However, unlike translationally active systems, phase separation is not observed, and the system remains spatially homogeneous. We then search for a near-equilibrium counterpart for our active spinners by measuring the equation of state. Interestingly, it agrees well with a hard-sphere model, despite the dissipative nature of the single particle dynamics."
    }
  ],
  "skills": [
    {
      "name": "Robotics",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Medical Robotics",
        "Teleoperation"
      ]
    },
    {
      "name": "Haptics",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Wearable device development",
        "Haptic signal design"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Spanish",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "Portuguese",
      "fluency": "Native speaker",
      "icon": ""
    }
  ]
}
